app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
    def index
        render json: Product.all, status: :ok

INSERT INTO "products" ("name", "user_id", "price", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        product = Product.create(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 60], ["updated_at", "2022-12-08 12:05:08.618395"], ["id", 13]]
---
    def update
        product = Product.find(params[:id])
        product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 19]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def destroy
        Product.find(params[:id]).destroy