app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "category", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
        user = User.find_by(id:session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]